TL = [1; 2; 3; 4.1; 5; 6];  % 示例 TL 输入，形状为 (6,1)
    M66_input = [1, 0, 0, 0, 0, 0;
                 0, 2, 0, 0, 0, 0;
                 0, 0, 3, 0, 0, 0;
                 0, 0, 0, 4, 0, 0;
                 0, 0, 0, 0, 5, 0;
                 0, 0, 0, 0, 0, 6];  % 示例 M66 输入，形状为 (6, 6)

    % 将 M66 重塑为列向量
    M = reshape(M66_input.', [], 1);  % 将 M66 转置并重塑为列向量，形状为 (36, 1)
    M66 = [M(1) M(2) M(3) M(4) M(5) M(6)
       M(7) M(8) M(9) M(10) M(11) M(12)
       M(13) M(14) M(15) M(16) M(17) M(18)
       M(19) M(20) M(21) M(22) M(23) M(24)
       M(25) M(26) M(27) M(28) M(29) M(30)
       M(31) M(32) M(33) M(34) M(35) M(36)];
    % 使用输入参数
    ddq = M66 \ TL;  % 使用左除运算符求解方程 M66_reshaped * ddq = TL
    ddq_out=[ddq(3);ddq(4)];

    tt = [1;2
         3;4]