% 手动设置固定的输入值
W = ones(26, 1);  % 长度为 26，全为 1 的列向量
e13_com = 0.5; e14_com = 0.7;  % 设定 e13_com 和 e14_com 的值
qd3 = 0.3; qd4 = 0.4; dqd3 = 0.2; dqd4 = 0.1; ddqd3 = 0.6; ddqd4 = 0.8;  % 设定其他值
q = [0.1; 0.2];  % 长度为 2 的列向量
sq = [0.1; 0.2];  % 长度为 2 的列向量
dq = [0.4; 0.6];  % 长度为 2 的列向量
dt = 0.123;

%% 一、参数
%     1)控制器增益
            k13=15;k14=15;    k23=1;k24=1;    k33=100;k34=100;
            K1=[k13;k14];     K2=[k23;k24];   K3=[k33;k34];
            K1=diag(K1);      K2=diag(K2);    K3=diag(K3);
%     2)双环BLF
            rho_13=.008;rho_14=.008;  rho_33=.5;rho_34=.5;
            rho_11=rho_13;rho_12=rho_14;  rho_31=rho_33;rho_32=rho_34;
%     3)RBFNN            
            nodes=13;  Tau11=60;Tau12=60;  eta1=0.01;  b=60;
            c=[-30 -25 -20 -15 -10 -5 0 5 10 15 20 25 30;
               -30 -25 -20 -15 -10 -5 0 5 10 15 20 25 30];
       

e1_com=[e13_com;e14_com];
qd=[qd3;qd4]; 
dqd=[dqd3;dqd4];
e1=sq-qd;
% e1=q-(qd-.5*e1_com); % OK
miu=-K1*e1+dqd;
e2=dq-miu;
e3=K2*e1+e2;
u_BLF2_denominator_1=rho_31^2-e3(1)^2;
u_BLF2_denominator_2=rho_32^2-e3(2)^2;
u_BLF2=[e3(1)/u_BLF2_denominator_1;
        e3(2)/u_BLF2_denominator_2];
xi1=[sq(1);dq(1)];xi2=[sq(2);dq(2)];
h1=zeros(nodes,1);h2=zeros(nodes,1);
for j=1:1:nodes
    h1(j)=exp(-norm(xi1-c(:,j))^2/(b*b));
    h2(j)=exp(-norm(xi2-c(:,j))^2/(b*b));
end
W1=W(1:nodes,1);W2=W(nodes+1:2*nodes,1);
dW=zeros(2*nodes,1);
for i=1:1:nodes
    dW(i)=Tau11*h1(i)*u_BLF2(1)-eta1*W1(i); 
    dW(nodes+i)=Tau12*h2(i)*u_BLF2(2)-eta1*W2(i); 
end
NN=W+dW*dt;
aaa = [2.5206580030568984;
2.77433438900223;
3.0135443961278257;
3.2223496184088205;
3.3855655001454323;
3.490574699609854;
3.5289362313925743;
3.4975060016825714;
3.3988623767147206;
3.240956871101042;
3.0360556090044186;
2.7991670554019867;
2.546235355647159;
2.6925670722741546;
2.9765456359374696;
3.244869192095672;
3.4797148206064645;
3.6640420376924894;
3.7836228050856793;
3.828853256107307;
3.7960274741759474;
3.687838952070808;
3.513015596711884;
3.2851568962557156;
3.0209881828049325;
2.7383426222751086;
];
sum(NN - aaa)